src/exps/fio_benchmarks/paperexps/CMR-256G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=24841: Fri Sep 28 22:02:16 2018
  write: IOPS=230, BW=922KiB/s (944kB/s)(162MiB/180002msec)
    clat (usec): min=176, max=84763, avg=4330.12, stdev=2457.41
     lat (usec): min=177, max=84764, avg=4331.01, stdev=2457.42
    clat percentiles (usec):
     |  1.00th=[ 2311],  5.00th=[ 2737], 10.00th=[ 2966], 20.00th=[ 3228],
     | 30.00th=[ 3425], 40.00th=[ 3654], 50.00th=[ 3884], 60.00th=[ 4178],
     | 70.00th=[ 4555], 80.00th=[ 4883], 90.00th=[ 5342], 95.00th=[ 5866],
     | 99.00th=[14222], 99.50th=[15139], 99.90th=[35390], 99.95th=[35914],
     | 99.99th=[44827]
   bw (  KiB/s): min=  610, max= 1468, per=79.40%, avg=731.26, stdev=57.12, samples=359
   iops        : min=  152, max=  367, avg=182.43, stdev=14.30, samples=359
  lat (usec)   : 250=0.10%, 500=0.13%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.20%, 4=53.58%, 10=42.76%, 20=2.91%, 50=0.29%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.25%, sys=0.77%, ctx=41486, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,41482,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=25084: Fri Sep 28 22:02:16 2018
  write: IOPS=229, BW=918KiB/s (940kB/s)(269MiB/300002msec)
    clat (usec): min=172, max=335246, avg=4348.44, stdev=2871.24
     lat (usec): min=173, max=335247, avg=4349.32, stdev=2871.24
    clat percentiles (usec):
     |  1.00th=[ 2376],  5.00th=[ 2769], 10.00th=[ 2999], 20.00th=[ 3228],
     | 30.00th=[ 3425], 40.00th=[ 3654], 50.00th=[ 3884], 60.00th=[ 4146],
     | 70.00th=[ 4490], 80.00th=[ 4817], 90.00th=[ 5276], 95.00th=[ 5800],
     | 99.00th=[14222], 99.50th=[15139], 99.90th=[35390], 99.95th=[35914],
     | 99.99th=[76022]
   bw (  KiB/s): min=  624, max= 1064, per=100.00%, avg=917.96, stdev=52.81, samples=600
   iops        : min=  156, max=  266, avg=229.48, stdev=13.20, samples=600
  lat (usec)   : 250=0.07%, 500=0.11%, 1000=0.01%
  lat (msec)   : 2=0.19%, 4=54.35%, 10=41.80%, 20=3.18%, 50=0.28%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=0.25%, sys=0.85%, ctx=68856, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,68846,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=922KiB/s (944kB/s), 922KiB/s-922KiB/s (944kB/s-944kB/s), io=162MiB (170MB), run=180002-180002msec

Run status group 1 (all jobs):
  WRITE: bw=918KiB/s (940kB/s), 918KiB/s-918KiB/s (940kB/s-940kB/s), io=269MiB (282MB), run=300002-300002msec

Disk stats (read/write):
  sdc: ios=123/110290, merge=0/0, ticks=37/472681, in_queue=472560, util=98.43%