src/exps/fio_benchmarks/paperexps/CMR-2G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=19737: Fri Sep 28 21:06:10 2018
  write: IOPS=356, BW=1424KiB/s (1458kB/s)(250MiB/180001msec)
    clat (usec): min=162, max=74526, avg=2799.77, stdev=2075.80
     lat (usec): min=162, max=74526, avg=2800.63, stdev=2075.79
    clat percentiles (usec):
     |  1.00th=[  241],  5.00th=[ 1287], 10.00th=[ 1795], 20.00th=[ 2376],
     | 30.00th=[ 2507], 40.00th=[ 2573], 50.00th=[ 2606], 60.00th=[ 2671],
     | 70.00th=[ 2769], 80.00th=[ 2900], 90.00th=[ 3228], 95.00th=[ 3916],
     | 99.00th=[12518], 99.50th=[12911], 99.90th=[24249], 99.95th=[33817],
     | 99.99th=[34341]
   bw (  KiB/s): min=  912, max= 2080, per=78.91%, avg=1123.65, stdev=74.65, samples=359
   iops        : min=  228, max=  520, avg=280.53, stdev=18.68, samples=359
  lat (usec)   : 250=1.31%, 500=3.54%, 750=0.02%, 1000=0.04%
  lat (msec)   : 2=8.38%, 4=81.94%, 10=2.71%, 20=1.69%, 50=0.37%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.36%, sys=1.15%, ctx=64095, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,64089,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=20070: Fri Sep 28 21:06:10 2018
  write: IOPS=354, BW=1419KiB/s (1453kB/s)(416MiB/300001msec)
    clat (usec): min=157, max=84438, avg=2810.34, stdev=2074.49
     lat (usec): min=160, max=84438, avg=2811.19, stdev=2074.48
    clat percentiles (usec):
     |  1.00th=[  247],  5.00th=[ 1434], 10.00th=[ 1811], 20.00th=[ 2343],
     | 30.00th=[ 2507], 40.00th=[ 2573], 50.00th=[ 2638], 60.00th=[ 2671],
     | 70.00th=[ 2769], 80.00th=[ 2933], 90.00th=[ 3228], 95.00th=[ 4015],
     | 99.00th=[12518], 99.50th=[12911], 99.90th=[24249], 99.95th=[33162],
     | 99.99th=[34341]
   bw (  KiB/s): min= 1160, max= 1712, per=100.00%, avg=1418.90, stdev=71.22, samples=600
   iops        : min=  290, max=  428, avg=354.71, stdev=17.81, samples=600
  lat (usec)   : 250=1.11%, 500=3.53%, 750=0.01%, 1000=0.03%
  lat (msec)   : 2=8.58%, 4=81.72%, 10=2.92%, 20=1.73%, 50=0.37%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.38%, sys=1.28%, ctx=106421, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,106413,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1424KiB/s (1458kB/s), 1424KiB/s-1424KiB/s (1458kB/s-1458kB/s), io=250MiB (263MB), run=180001-180001msec

Run status group 1 (all jobs):
  WRITE: bw=1419KiB/s (1453kB/s), 1419KiB/s-1419KiB/s (1453kB/s-1453kB/s), io=416MiB (436MB), run=300001-300001msec

Disk stats (read/write):
  sdc: ios=125/170452, merge=0/0, ticks=91/469254, in_queue=469103, util=97.71%