src/exps/fio_benchmarks/paperexps/CMR-2T.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=27001: Fri Sep 28 22:26:18 2018
  write: IOPS=166, BW=667KiB/s (683kB/s)(117MiB/180003msec)
    clat (usec): min=192, max=90089, avg=5985.14, stdev=3587.13
     lat (usec): min=193, max=90090, avg=5985.99, stdev=3587.14
    clat percentiles (usec):
     |  1.00th=[ 2507],  5.00th=[ 3261], 10.00th=[ 3654], 20.00th=[ 4293],
     | 30.00th=[ 4752], 40.00th=[ 5080], 50.00th=[ 5407], 60.00th=[ 5735],
     | 70.00th=[ 6128], 80.00th=[ 6652], 90.00th=[ 7701], 95.00th=[10814],
     | 99.00th=[17171], 99.50th=[19006], 99.90th=[46924], 99.95th=[48497],
     | 99.99th=[86508]
   bw (  KiB/s): min=  426, max= 1145, per=80.61%, avg=537.66, stdev=49.32, samples=359
   iops        : min=  106, max=  286, avg=134.08, stdev=12.33, samples=359
  lat (usec)   : 250=0.11%, 500=0.19%, 1000=0.01%
  lat (msec)   : 2=0.09%, 4=14.83%, 10=79.46%, 20=4.87%, 50=0.41%
  lat (msec)   : 100=0.04%
  cpu          : usr=0.19%, sys=0.57%, ctx=30029, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,30027,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=27280: Fri Sep 28 22:26:18 2018
  write: IOPS=170, BW=681KiB/s (697kB/s)(199MiB/300011msec)
    clat (usec): min=202, max=292993, avg=5865.46, stdev=3657.28
     lat (usec): min=203, max=292994, avg=5866.28, stdev=3657.28
    clat percentiles (usec):
     |  1.00th=[ 2573],  5.00th=[ 3261], 10.00th=[ 3654], 20.00th=[ 4228],
     | 30.00th=[ 4686], 40.00th=[ 5014], 50.00th=[ 5342], 60.00th=[ 5669],
     | 70.00th=[ 6063], 80.00th=[ 6521], 90.00th=[ 7504], 95.00th=[ 9241],
     | 99.00th=[17171], 99.50th=[19006], 99.90th=[46400], 99.95th=[47973],
     | 99.99th=[78119]
   bw (  KiB/s): min=  464, max=  904, per=100.00%, avg=680.93, stdev=48.36, samples=600
   iops        : min=  116, max=  226, avg=170.22, stdev=12.09, samples=600
  lat (usec)   : 250=0.07%, 500=0.09%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.11%, 4=15.42%, 10=79.71%, 20=4.16%, 50=0.40%
  lat (msec)   : 100=0.04%, 500=0.01%
  cpu          : usr=0.20%, sys=0.64%, ctx=51075, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,51068,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=667KiB/s (683kB/s), 667KiB/s-667KiB/s (683kB/s-683kB/s), io=117MiB (123MB), run=180003-180003msec

Run status group 1 (all jobs):
  WRITE: bw=681KiB/s (697kB/s), 681KiB/s-681KiB/s (697kB/s-697kB/s), io=199MiB (209MB), run=300011-300011msec

Disk stats (read/write):
  sdc: ios=84/81065, merge=0/0, ticks=29/474676, in_queue=474580, util=98.86%