src/exps/fio_benchmarks/paperexps/CMR-32G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=22701: Fri Sep 28 21:38:13 2018
  write: IOPS=285, BW=1143KiB/s (1170kB/s)(201MiB/180003msec)
    clat (usec): min=168, max=105141, avg=3490.78, stdev=2340.70
     lat (usec): min=169, max=105142, avg=3491.66, stdev=2340.70
    clat percentiles (usec):
     |  1.00th=[ 1844],  5.00th=[ 2474], 10.00th=[ 2606], 20.00th=[ 2802],
     | 30.00th=[ 2966], 40.00th=[ 3064], 50.00th=[ 3163], 60.00th=[ 3261],
     | 70.00th=[ 3392], 80.00th=[ 3556], 90.00th=[ 3884], 95.00th=[ 4359],
     | 99.00th=[13304], 99.50th=[13698], 99.90th=[33817], 99.95th=[34866],
     | 99.99th=[74974]
   bw (  KiB/s): min=  694, max= 1621, per=79.05%, avg=902.77, stdev=66.16, samples=359
   iops        : min=  173, max=  405, avg=225.30, stdev=16.55, samples=359
  lat (usec)   : 250=0.18%, 500=0.31%, 1000=0.01%
  lat (msec)   : 2=0.70%, 4=90.86%, 10=5.19%, 20=2.50%, 50=0.22%
  lat (msec)   : 100=0.02%, 250=0.01%
  cpu          : usr=0.32%, sys=0.95%, ctx=51436, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,51431,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=22940: Fri Sep 28 21:38:13 2018
  write: IOPS=285, BW=1141KiB/s (1169kB/s)(334MiB/300002msec)
    clat (usec): min=165, max=84697, avg=3495.55, stdev=2266.59
     lat (usec): min=165, max=84698, avg=3496.39, stdev=2266.59
    clat percentiles (usec):
     |  1.00th=[ 1893],  5.00th=[ 2474], 10.00th=[ 2606], 20.00th=[ 2802],
     | 30.00th=[ 2966], 40.00th=[ 3064], 50.00th=[ 3163], 60.00th=[ 3261],
     | 70.00th=[ 3392], 80.00th=[ 3556], 90.00th=[ 3916], 95.00th=[ 4424],
     | 99.00th=[13304], 99.50th=[13698], 99.90th=[34341], 99.95th=[34866],
     | 99.99th=[73925]
   bw (  KiB/s): min=  848, max= 1576, per=100.00%, avg=1141.44, stdev=65.21, samples=600
   iops        : min=  212, max=  394, avg=285.34, stdev=16.30, samples=600
  lat (usec)   : 250=0.12%, 500=0.25%, 750=0.01%, 1000=0.02%
  lat (msec)   : 2=0.78%, 4=90.32%, 10=5.79%, 20=2.48%, 50=0.23%
  lat (msec)   : 100=0.02%
  cpu          : usr=0.29%, sys=1.07%, ctx=85621, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,85603,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1143KiB/s (1170kB/s), 1143KiB/s-1143KiB/s (1170kB/s-1170kB/s), io=201MiB (211MB), run=180003-180003msec

Run status group 1 (all jobs):
  WRITE: bw=1141KiB/s (1169kB/s), 1141KiB/s-1141KiB/s (1169kB/s-1169kB/s), io=334MiB (351MB), run=300002-300002msec

Disk stats (read/write):
  sdc: ios=43/136994, merge=0/0, ticks=51/471199, in_queue=471061, util=98.12%